// приватная страница - нужно будет проверять на авторизацию и если не авторизован - делать перенаправление на welcome
// Должен быть header
// Редактор запросов/просмотрщик JSON. Редактор запросов должен поддерживать предварительное оформление. Любое стороннее решение/решение с открытым исходным кодом запрещено, вы должны реализовать его самостоятельно. Средство просмотра JSON должно быть доступно только для чтения, оно будет использоваться в разделе ответов.
// Раздел редактора переменных.
// Раздел редактора заголовков (если вы делаете запрос CORS, каждый добавленный заголовок должен поддерживаться серверной частью, учтите это).
// Раздел документации должен быть виден только тогда, когда приложение получает успешный ответ с определением схемы от API.
// Раздел ответов. Должен быть представлен одним и тем же компонентом редактора запросов/просмотра JSON. Следует только читать.
// Кнопка «Изменить конечную точку» — позволяет пользователю переключиться на произвольную конечную точку GraphQL.
// Функциональный редактор, позволяющий редактировать запросы и улучшать 60 точек.
// Проводник эксплуатационной документации, видимый только при успешном запросе SDL 50 баллов
// Раздел переменных, который можно отображать или скрывать, указанные переменные отправляются на сервер 30 баллов
// Раздел заголовка, который можно показать или скрыть, добавленные пользователем заголовки отправляются на сервер 20 баллов
// Раздел ответов с редактором, доступным только для чтения, в качестве средства просмотра JSON 40 баллов

export default function Main() {
  return <div>Main</div>;
}
